#include"common.h"


//ÏÔÊ¾²Ëµ¥
void showMainMenu()
{
	//ÇåÆÁ
	system("cls");

	cout << "¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª" << endl;
	cout << "|============»¶Ó­Ê¹ÓÃGg¼ÇÕË²¾ `o`============|" << endl;
	cout << "|**************   1¡¢¼ÇÕË     ***************|" << endl;
	cout << "|**************   2¡¢²éÑ¯     ***************|" << endl;
	cout << "|**************   3¡¢ÍË³ö     ***************|" << endl;
	cout << "¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª" << endl;
	cout << "ÇëÑ¡Ôñ£¨1-3£©£º";
}

void showAccountMenu()
{
	cout << "¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª" << endl;
	cout << "|=================Ñ¡Ôñ¼ÇÕËÖÖÀà===============|" << endl;
	cout << "|**************   1¡¢ÊÕÈë      **************|" << endl;
	cout << "|**************   2¡¢Ö§³ö      **************|" << endl;
	cout << "|**************   3¡¢·µ»ØÖ÷²Ëµ¥ *************|" << endl;
	cout << "¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª" << endl;
	cout << "ÇëÑ¡Ôñ£¨1-3£©£º";
}

void successMenu()
{
	//ÏÔÊ¾³É¹¦ÐÅÏ¢
	cout << "\n-------------------¼ÇÕË³É¹¦£¡------------------------\n" << endl;
	cout << "\nÇë°´»Ø³µ¼ü·µ»ØÖ÷²Ëµ¥¡­¡­" << endl;
}

void showQueryMenu()
{
	cout << "¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª" << endl;
	cout << "|=================Ñ¡Ôñ²éÑ¯Ìõ¼þ===============|" << endl;
	cout << "|************   1¡¢Í³¼ÆËùÓÐÕËÄ¿  ************|" << endl;
	cout << "|************   2¡¢Í³¼ÆÊÕÈë      ************|" << endl;
	cout << "|************   3¡¢Í³¼ÆÖ§³ö      ************|" << endl;
	cout << "|************   4¡¢·µ»ØÖ÷²Ëµ¥    ************|" << endl;
	cout << "¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª" << endl;
	cout << "ÇëÑ¡Ôñ£¨1-4£©£º";
}
